; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v2 - type_2 ?v5 - type_1)
 	      (pred_1 ?v4 - object ?v5 - type_1)
	      (pred_3 ?v2 - type_2 ?v1 - type_3)
	      (pred_4 ?v2 - type_2 ?v4 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v2 - type_2 ?v7 ?v3 - type_1)
       :precondition (and  (pred_2 ?v2 ?v7))
       :effect (and  (pred_2 ?v2 ?v3)
		     (not (pred_2 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v8 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v8) (pred_2 ?v2 ?v8) (pred_3 ?v2 ?v1))
       :effect (and (pred_4 ?v2 ?v6 ?v1)
		    (not (pred_1 ?v6 ?v8)) 
		    (not (pred_3 ?v2 ?v1))))

   (:action op_2
       :parameters (?v2 - type_2 ?v6 - object ?v8 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_4 ?v2 ?v6 ?v1) (pred_2 ?v2 ?v8))
       :effect (and (pred_1 ?v6 ?v8)
		    (pred_3 ?v2 ?v1)
		    (not (pred_4 ?v2 ?v6 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_06 - type_2
obj_11 obj_03 obj_05 obj_02 - type_3
obj_01 obj_07 obj_04 - type_1
obj_09 obj_12 obj_08 - object)
(:init
(pred_2 obj_10 obj_07)
(pred_3 obj_10 obj_11)
(pred_3 obj_10 obj_03)
(pred_2 obj_06 obj_04)
(pred_3 obj_06 obj_05)
(pred_3 obj_06 obj_02)
(pred_1 obj_09 obj_04)
(pred_1 obj_12 obj_07)
(pred_1 obj_08 obj_07)
)
(:goal
(and
(pred_1 obj_09 obj_07)
(pred_1 obj_12 obj_07)
(pred_1 obj_08 obj_04)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_04)))
)
)

; plan
1. (op_3 obj_10 obj_07 obj_01)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_01)
   goals met: 1 of 3
2. (op_1 obj_06 obj_09 obj_04 obj_02)
   deleted: (pred_1 obj_09 obj_04) (pred_3 obj_06 obj_02)
   added: (pred_4 obj_06 obj_09 obj_02)
   goals met: 1 of 3
3. (op_3 obj_06 obj_04 obj_07)
   deleted: (pred_2 obj_06 obj_04)
   added: (pred_2 obj_06 obj_07)
   goals met: 1 of 3
4. (op_2 obj_06 obj_09 obj_07 obj_02)
   deleted: (pred_4 obj_06 obj_09 obj_02)
   added: (pred_1 obj_09 obj_07) (pred_3 obj_06 obj_02)
   goals met: 2 of 3
5. (op_1 obj_06 obj_08 obj_07 obj_05)
   deleted: (pred_1 obj_08 obj_07) (pred_3 obj_06 obj_05)
   added: (pred_4 obj_06 obj_08 obj_05)
   goals met: 2 of 3
6. (op_3 obj_06 obj_07 obj_04)
   deleted: (pred_2 obj_06 obj_07)
   added: (pred_2 obj_06 obj_04)
   goals met: 2 of 3
7. (op_2 obj_06 obj_08 obj_04 obj_05)
   deleted: (pred_4 obj_06 obj_08 obj_05)
   added: (pred_1 obj_08 obj_04) (pred_3 obj_06 obj_05)
   goals met: 3 of 3
